app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries"
---
  def index
    @entries = Entry.all

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @entry = Entry.find(params[:id])

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users"
---
  def edit
    @entry = Entry.find(params[:id])
    @users = User.all

INSERT INTO "entries" ("cough", "created_at", "entrytime", "fever", "medication", "other", "runnynose", "sickstatus", "sorethroat", "stomachache", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @entry = Entry.new(params[:entry])
    raise params.to_yaml

    respond_to do |format|
      if @entry.save