app/controllers/trends_controller.rb

SELECT "trends".* FROM "trends"
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = 1
SELECT "users".* FROM "users" WHERE "users"."phone" IN (1234567890, 1234567890, 4433863616)
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = 1
---
  def index
    @trends = Trend.all
    @friendsphones = User.first.friends.map {|f| f.phone}
    @sickfriends = User.find_all_by_phone(@friendsphones)

    @allsickfriendentries = Array.new

    @weekago = Time.now - 1.week
    @sickfriends.each do |f|
      f.entries.each do |e|